cool/tutorials/combustion/XiFoam/les/pitzDaily/0/Tu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Tu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 293;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 293;
    }

    upperWall
    {
        type            fixedValue;
        value           uniform 293;
    }

    lowerWall
    {
        type            fixedValue;
        value           uniform 570;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
